package array;

public class Ex10 {
/*
  
		1) 프로그램은 데이터를 처리하는 것이 목적이다
		어떤 유형(자료형)의 데이터를 어떤 방식(메서드)으로 처리하는가?
		
		2) 자료형의 발전
		 - 단일 데이터(변수)
		 - 같은 자료형의 여러 데이터(배열)
		 - 서로 다른 자료형의 여러 변수를 묶는 사용자 정의 자료형(구조체)
		 - 서로 다른 자료형의 여러 변수 + 함수를 포함하는 자료형(클래스)
		 
		3) 함수의 이해
		 - function, 기능, 방식, method
		 - 일정한 코드를 묶어서 원할 때 실행할 수 있는 형태로 이름을 붙여둔 것
		 - 입력값과 출력값(인자값과 반환값)을 가질 수 있다
		 - y = f(x)
		 - x에 어떤 값을 넣는지에 따라, y값이 결정되는 일정한 수식(코드)
		 
		4) 배열의 특징
		 - 같은 데이터의 여러 자료를 묶어서 관리한다
		 - 같은 자료형의 데이터들이므로, 메모리에서 차지하는 공간의 크기가 일정하다
		 - 연속된 메모리 공간에 배치하기 때문에 순번이 존재한다
		 - 배열의 내부 요소가 몇개인지 배열의 길이 개념이 존재한다
		 - 일정한 크기만큼 반복하면서 내부 요소에 대해 일정한 코드를 수행(for)
		 
 */
}
